In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from mysql-connector-python) (4.21.12)

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\durga\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import mysql.connector 
import pandas as pd

In [9]:
conn=mysql.connector.connect(host='localhost',  
                        user='root', 
                        password='12345',
                        database='e_commerce') 
curr=conn.cursor()

In [10]:
curr.execute("DROP TABLE IF EXISTS SUPPLIER")
curr.execute("DROP TABLE IF EXISTS CUSTOMER")
curr.execute("DROP TABLE IF EXISTS CATEGORY")
curr.execute("DROP TABLE IF EXISTS PRODUCT")
curr.execute("DROP TABLE IF EXISTS PRODUCT_DETAILS")


sql ='''CREATE TABLE SUPPLIER(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))'''

sql1='''CREATE TABLE CUSTOMER(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))
'''
sql2='''
CREATE TABLE category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))
'''
sql3='''
CREATE TABLE product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))
'''
sql4='''
CREATE TABLE product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
'''


curr.execute(sql)
curr.execute(sql1)
curr.execute(sql2)
curr.execute(sql3)
curr.execute(sql4)

In [11]:
curr.execute("DROP TABLE IF EXISTS RATING")
curr.execute("DROP TABLE IF EXISTS ORDERS")

sql5='''CREATE TABLE orders (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))
'''
sql6='''
CREATE TABLE rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))
'''
curr.execute(sql5)
curr.execute(sql6)

In [12]:
s="insert into supplier (supp_id,supp_name,supp_city,supp_phone) values (%s,%s,%s,%s)"
val=[
    (1,'Rajesh Retails' ,'Delhi','1234567890'),
    (2 , 'Appario Ltd.' , 'Mumbai' , '2589631470'),
    (3 , 'Knome products' , 'Bangalore' , '9785462315'),
    (4 , 'Bansal Retails' , 'Kochi' , '8975463285'),
    (5 , 'Mittal Ltd.' , 'Lucknow' , '7898456532')
]
curr.executemany(s,val)
conn.commit()

In [13]:
curr=conn.cursor()
q="insert into customer (cus_id,cus_name,cus_phone,cus_city,cus_gender) values (%s,%s,%s,%s,%s)"
val1=[
(1,  'AAKASH',  '9999999999',  'DELHI',  'M'), 
 (2,  'AMAN',  '9785463215',  'NOIDA',  'M'), 
 (3,  'NEHA',  '9999999998',  'MUMBAI',  'F'), 
 (4,  'MEGHA', '9994562399',  'KOLKATA',  'F'), 
 (5,  'PULKIT', '7895999999',  'LUCKNOW',  'M')
]
curr.executemany(q,val1)
conn.commit()

In [14]:
q="insert into category (cat_id,cat_name) values (%s,%s)"
val1=[
(1,  'BOOKS'), 
 (2,  'GAMES'),
 (3,  'GROCERIES'),
 (4,  'ELECTRONICS'),
 (5,  'CLOTHES'),
]
curr.executemany(q,val1)
conn.commit()

In [15]:
q="insert into product (pro_id,pro_name,pro_desc,cat_id) values (%s,%s,%s,%s)"
val1=[
(1,  'GTA V',  'DFJDJFDJFDJFDJFJF', 2), 
 (2,  'TSHIRT',  'DFDFJDFJDKFD',  5), 
 (3,  'ROG LAPTOP',  'DFNTTNTNTERND',  4), 
 (4,  'OATS',  'REURENTBTOTH',3), 
 (5,  'HARRY POTTER',  'NBEMCTHTJTH',  1)
]
curr.executemany(q,val1)
conn.commit()

In [16]:
q="insert into product_details (prod_id,pro_id,supp_id,prod_price) values (%s,%s,%s,%s)"
val1=[
(1,1,2,1500), 
 (2,3,5,30000),
    (3,5,1,3000),
    (4,2,3,2500),
    (5,4,1,1000)
]
curr.executemany(q,val1)
conn.commit()

In [17]:
q="INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val1 = [(20,1500,"2021-10-12",3,5),
(25,30500,"2021-09-16",5,2),
(26,2000,"2021-10-05",1,1),
(30,3500,"2021-08-16",4,3),
(50,2000,"2021-10-06",2,1)]
curr.executemany(q,val1)
conn.commit()

In [18]:
q = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val1 = [(1,2,2,4),
(2,3,4,3),
(3,5,1,5),
(4,1,3,2),
(5,4,5,4)]
curr.executemany(q,val1)
conn.commit()

In [19]:
conn.close()
conn=mysql.connector.connect(host='localhost',  
                        user='root', 
                        password='12345',
                        database='e_commerce') 
curr=conn.cursor(buffered=True)
Query3= """select customer.cus_gender,count(customer.cus_gender) as count
from customer inner join `orders` on customer.cus_id=`orders`.cus_id
where `orders`.ord_amount>=3000 group by customer.cus_gender;"""
curr.execute(Query3)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['CUS_GENDER','COUNT'])
output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

In [20]:
Query4= """select `orders`.*,product.pro_name from `orders` ,product_details,product
where `orders`.cus_id=2 and `orders`.prod_id=product_details.prod_id and product_details.pro_id=product.pro_id;"""
curr.execute(Query4)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

In [21]:
Query5= """select supplier.* from supplier,product_details
where supplier.supp_id in
(select product_details.supp_id from product_details
group by product_details.supp_id having count(product_details.supp_id)>1)
group by supplier.supp_id;"""
curr.execute(Query5)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

In [22]:
Query06 = """SELECT CATEGORY.* FROM `ORDERS`
INNER JOIN PRODUCT_DETAILS ON `ORDERS`.PROD_ID = PRODUCT_DETAILS.PROD_ID
INNER JOIN PRODUCT ON PRODUCT.PRO_ID = PRODUCT_DETAILS.PRO_ID
INNER JOIN CATEGORY ON CATEGORY.CAT_ID = PRODUCT.CAT_ID
WHERE `ORDERS`.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM `ORDERS`);"""
curr.execute(Query06)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME'])
output_df

   CAT_ID   CAT_NAME
0       3  GROCERIES

In [23]:
Query7= """select product.pro_id,product.pro_name
from `orders` inner join product_details on product_details.prod_id=`orders`.prod_id
inner join product on product.pro_id=product_details.pro_id where `orders`.ord_date>"2021-10-05";"""
curr.execute(Query7)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

In [24]:
Query8= """select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars
from rating inner join supplier on rating.supp_id=supplier.supp_id
inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""
curr.execute(Query8)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','CUS_NAME','RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

In [25]:
Query9= """select customer.cus_name ,customer.cus_gender from customer where customer.cus_name like 'A%' or customer.cus_name like '%A';"""
curr.execute(Query9)
output = curr.fetchall()
output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [26]:
Query10 = """SELECT SUM(ORD_AMOUNT) AS TOTAL FROM (
SELECT O.ORD_AMOUNT,O.CUS_ID,C.CUS_GENDER
FROM orders O
INNER JOIN customer C
ON O.CUS_ID = C.CUS_ID
WHERE C.CUS_GENDER='M') T;"""
curr.execute(Query10)
output = curr.fetchall()
output_df = pd.DataFrame(output)
output_df

       0
0  34500

In [27]:
Query11="""SELECT * FROM e_commerce.customer C
LEFT OUTER JOIN e_commerce.orders O
ON C.CUS_ID=O.CUS_ID;"""
curr.execute(Query11)
output=curr.fetchall()
output_df = pd.DataFrame(output)
output_df

conn.close()

In [28]:
print("Happy Learning")

Happy Learning